tests/fixtures/events/application_fee.refund.updated.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "application_00000000000000",
  "type": "application_fee.refund.updated",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2018-11-08",
  "data": {
    "object": {
      "id": "re_00000000000000",
      "object": "refund",
      "amount": 3400,
      "balance_transaction": "txn_00000000000000",
      "charge": "ch_00000000000000",
      "created": 1548848714,
      "currency": "eur",
      "metadata": {
      },
      "reason": null,
      "receipt_number": null,
      "source_transfer_reversal": null,
      "status": "succeeded",
      "transfer_reversal": null
    },
    "previous_attributes": {
    }
  }
}
