tests/fixtures/events/customer.subscription.created.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "customer.subscription.created_00000000000000",
  "type": "customer.subscription.created",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2018-11-08",
  "data": {
    "object": {
      "id": "sub_00000000000000",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1549296189,
      "billing_thresholds": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "created": 1549296189,
      "current_period_end": 1551715389,
      "current_period_start": 1549296189,
      "customer": "cus_00000000000000",
      "days_until_due": null,
      "default_source": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_00000000000000",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1549296189,
            "metadata": {
            },
            "plan": {
              "id": "plan_00000000000000",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 2500,
              "billing_scheme": "per_unit",
              "created": 1549041757,
              "currency": "eur",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": "Monthly subscription",
              "product": "prod_00000000000000",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "quantity": 1,
            "subscription": "sub_00000000000000"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_ET66shSN5vKSDe"
      },
      "livemode": false,
      "metadata": {
        "member_id": "ad3bbc8d-afc0-416b-b0e0-834267566e73"
      },
      "plan": {
        "id": "plan_00000000000000",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 2500,
        "billing_scheme": "per_unit",
        "created": 1549041757,
        "currency": "eur",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "nickname": "Monthly subscription",
        "product": "prod_00000000000000",
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "start": 1549296189,
      "status": "active",
      "tax_percent": null,
      "trial_end": null,
      "trial_start": null
    }
  }
}
