tests/fixtures/events/customer.subscription.updated.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "customer.subscription.updated",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2019-05-16",
  "data": {
    "object": {
      "id": "sub_00000000000000",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1549296189,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1549296189,
      "current_period_end": 1567612989,
      "current_period_start": 1564934589,
      "customer": "cus_00000000000000",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [
      ],
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_00000000000000",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1549296189,
            "metadata": {
            },
            "plan": {
              "id": "plan_00000000000000",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 2500,
              "billing_scheme": "per_unit",
              "created": 1549041757,
              "currency": "eur",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": "Monthly subscription",
              "product": "prod_00000000000000",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "quantity": 1,
            "subscription": "sub_00000000000000",
            "tax_rates": [
            ]
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_ET66shSN5vKSDe"
      },
      "latest_invoice": "in_1F3mAyIpafQncvOMeAHc3r5u",
      "livemode": false,
      "metadata": {
        "member_id": "ad3bbc8d-afc0-416b-b0e0-834267566e73"
      },
      "pending_setup_intent": null,
      "plan": {
        "id": "plan_00000000000000",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 2500,
        "billing_scheme": "per_unit",
        "created": 1549041757,
        "currency": "eur",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "nickname": "Monthly subscription",
        "product": "prod_00000000000000",
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start": 1549296189,
      "start_date": 1549296189,
      "status": "active",
      "tax_percent": null,
      "trial_end": null,
      "trial_start": null
    },
    "previous_attributes": {
      "plan": {
        "id": "OLD_00000000000000",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 14400,
        "billing_scheme": "per_unit",
        "created": 1560872915,
        "currency": "eur",
        "interval": "year",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "nickname": "1 year subscription",
        "product": "prod_00000000000000",
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed",
        "name": "Old plan"
      }
    }
  }
}
