tests/fixtures/events/invoice.marked_uncollectible.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "invoice.marked_uncollectible",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2019-02-19",
  "data": {
    "object": {
      "id": "in_00000000000000",
      "object": "invoice",
      "amount_due": 2500,
      "amount_paid": 2500,
      "amount_remaining": 0,
      "application_fee": null,
      "attempt_count": 1,
      "attempted": true,
      "auto_advance": false,
      "billing": "charge_automatically",
      "billing_reason": "subscription_create",
      "charge": "ch_00000000000000",
      "created": 1549296189,
      "currency": "eur",
      "custom_fields": null,
      "customer": "cus_00000000000000",
      "date": 1549296189,
      "default_source": null,
      "description": null,
      "discount": null,
      "due_date": null,
      "ending_balance": 0,
      "finalized_at": 1549296189,
      "footer": null,
      "hosted_invoice_url": "https://pay.stripe.com/invoice/invst_FNZK0N3bVGQttgijTeAbEaQMCz",
      "invoice_pdf": "https://pay.stripe.com/invoice/invst_FNZK0N3bVGQttgijTeAbEaQMCz/pdf",
      "lines": {
        "data": [
          {
            "id": "sli_00000000000000",
            "object": "line_item",
            "amount": 0,
            "currency": "eur",
            "description": "Trial period for Monthly subscription",
            "discountable": true,
            "livemode": false,
            "metadata": {
              "member_id": "323380a2-96a8-47c1-b3f9-7064e07b3a97"
            },
            "period": {
              "end": 1561505822,
              "start": 1554731146
            },
            "plan": {
              "id": "plan_00000000000000",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 2000,
              "billing_scheme": "per_unit",
              "created": 1550752212,
              "currency": "eur",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": "Monthly subscription",
              "product": "prod_00000000000000",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "proration": false,
            "quantity": 1,
            "subscription": "sub_00000000000000",
            "subscription_item": "si_00000000000000",
            "type": "subscription"
          }
        ],
        "has_more": false,
        "object": "list",
        "url": "/v1/invoices/in_1E09ubIpafQncvOMUhmgO0ph/lines"
      },
      "livemode": false,
      "metadata": {
      },
      "next_payment_attempt": null,
      "number": "51CECB1-0001",
      "paid": true,
      "period_end": 1549296189,
      "period_start": 1549296189,
      "receipt_number": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "paid",
      "status_transitions": {
        "finalized_at": 1549296189,
        "marked_uncollectible_at": null,
        "paid_at": 1549296189,
        "voided_at": null
      },
      "subscription": "sub_00000000000000",
      "subtotal": 2500,
      "tax": 0,
      "tax_percent": null,
      "total": 2500,
      "webhooks_delivered_at": 1549296189
    }
  }
}
