tests/fixtures/events/payment_intent.amount_capturable_updated.json

{
  "created": 1326853478,
  "livemode": false,
  "id": "payment_00000000000000",
  "type": "payment_intent.amount_capturable_updated",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2018-11-08",
  "data": {
    "object": {
      "id": "pi_00000000000000",
      "object": "payment_intent",
      "allowed_source_types": [
        "card"
      ],
      "amount": 1000,
      "amount_capturable": 1000,
      "amount_received": 0,
      "application": null,
      "application_fee_amount": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [
        ],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/charges?payment_intent=pi_Aabcxyz01aDfoo"
      },
      "client_secret": null,
      "confirmation_method": "publishable",
      "created": 123456789,
      "currency": "eur",
      "customer": null,
      "description": "PaymentIntent Description",
      "last_payment_error": null,
      "livemode": false,
      "metadata": {
        "order_id": "123456789"
      },
      "next_source_action": null,
      "on_behalf_of": null,
      "receipt_email": "jenny@example.com",
      "review": null,
      "shipping": {
        "address": {
          "city": "Anytown",
          "country": "US",
          "line1": "1234 Main street",
          "line2": null,
          "postal_code": "123456",
          "state": null
        },
        "carrier": null,
        "name": "Jenny Rosen",
        "phone": null,
        "tracking_number": null
      },
      "source": "src_00000000000000",
      "statement_descriptor": "PaymentIntent Statement Descriptor",
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    }
  }
}
